#1. Напишіть цикл, який буде вимагати від користувача ввести слово, в якому є буква "о" (враховуються як великі так і
# маленькі). Цикл не повинен завершитися, якщо користувач ввів слово без букви "о".


#my_list1=str(input('Введіть слово, котре містить букву \'o\':'))
#my_list2=str.title(my_list1)

#while 'O' not in my_list2 :
    #print(('Введіть слова зановo:'))
    #input ()
#else: print('God job!')

#2.Є list з даними lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum']. Напишіть код,
# який свормує новий list (наприклад lst2), який містить лише змінні типу стрінг, які присутні в lst1. Зауважте, що
# lst1 не є статичним і може формуватися динамічно від запуску до запуску.

#lst1=list(input('Введіть ліст'))
#i=0
#lst2=[]
#for i in lst1:
    #if lst1.isinstance(i,str):
        #lst2 += i
       # print(lst2)
    #else: next(i)

#3 Є стрінг з певним текстом (можна скористатися input або константою). Напишіть код, який визначить кількість слів
# в цьому тексті, які закінчуються на "о" (враховуються як великі так і маленькі).

my_str=input()
my_str2=str.title(my_str)
h=0
for i in my_str2:
   if 'O ' in my_str2:
        h+=1
    else:
        h+=0
print(h)


