"""
Завдання 1
Макс 40 балів
написати програму, яка просить в користувача ввести через пробіл міста, в яких він був за минулі 10 років
потім окремо запросити у користувача міста, куди він хоче поїхати внаступні 10 років
вивести на екран повідомлення з текстом про те, що користувачу, мабуть, дуже сподобалося в містах, які він повторив в
двох циклах вводу, а саме... (сформувати строку, використовуючи join)
якщо повтору не було - вивести повідомлення, що користувач відкритий до чогось нового

врахувати випадки, що користувач нічого не вводить не потрібно, в даному випадку вам явно зазначено,
що ці перевірки не потрібні.
не потрібно перевіряти введення цифр
ми виходим із того, що користувач введе щось на зразок "Київ Тернопіль париЖ акапулько-80"

В той же час врахуйте, що користувач може вводити дані в різних регістрах

використати сети!!!

"""
# задача 1
#str1_1=input('Введіть через пробіл міста, в яких ви вже були ')
#str2_1=input('Введіть через пробіл міста, в яких ви хочете побувати в ближайші 10 років ')

#str1=(str1_1.upper()).split(' ')
#str2=(str2_1.upper()).split(' ')

#set1=set(str1)
#set2=set(str2)

#intersection = set1.intersection(set2)

#if set2.intersection(intersection) :
    #set3 = set(intersection)
    #my_str = 'Вам, мабуть, дуже сподобалось в '
    #my_str.split(' ')
    #set4 = set(my_str)
    #result = ' '.join(intersection)
    #print(my_str + result)
#else:
    #print('Ви відкриті до нового!')



student = {
    'Іван Петров': {
        'Пошта': 'Ivan@gmail.com',
        'Вік': 14,
        'Номер телефону': '+380987771221',
        'Середній бал': 95.8
    },
    'Женя Курич': {
        'Пошта': 'Geka@gmail.com',
        'Вік': 16,
        'Номер телефону': None,
        'Середній бал': 64.5
    },
    'Маша Кера': {
        'Пошта': 'Masha@gmail.com',
        'Вік': 18,
        'Номер телефону': '+380986671221',
        'Середній бал': 80
    },
}
"""
Завдання 2
макс 60 балів
зауважте, що значення, що зберігається в кожному елементі - теж словник, і доступ до вкладеного списку 
здійснюється за механізмом 
student[outer_dict_key][inner_dict_key]

Є дані студентів (комбінація імені та прізвища унікальна), що зберігаються за допомогою словника
1 - програмно добавити одного студента, з заповненням усіх полів (вік - від 18 до 40, цілочисельне значення, 
    бал від 0 до 100 (інт чи флоат)
"""
    #name=input("Введіть ім'я студента:")
#last_name=input('Введіть прізвище студента:')
#email=input('Введіть електронну пошту:')

#try:
    #age = int(input('Введіть вік:'))
    #while age < 18 or age > 40:
        #print('Вік студента повинен бути від 18 до 40 років в числовому форматі без пунктуації')
        #age = int(input('Введіть вік:'))
#except ValueError:
        #print('Вік студента повинен бути від 18 до 40 років в числовому форматі без пунктуації')
        #age = int(input('Введіть вік:'))


#phone_number = input('Введіть мобільний номер:')


#try:
    #mark = int(input('Введіть середній бал:'))
    #while mark > 100 :
        #print('Середній бал повинен бути менше 100 в числовому форматі без пунктуації')
        #mark = int(input('Введіть середній бал:'))
#except ValueError:
        #print('Середній бал повинен бути менше 100 в числовому форматі без пунктуації')
        #age = int(input('Введіть вік:'))

#student[name + last_name] = dict([('Пошта', email), ('Вік', age), ('Номер телефону', phone_number), ('Середній бал', mark)])

"""

2 - створити і вивести на екран список студентів (імя та прізвище та середній бал), у яких середній бал більше 90
    сам формат наповнення цього списку up to you
"""
  #lst=(list(student.keys()))
#for lst in student:
    #if int(student[lst]['Середній бал']) > 80:
        #print(lst +' ' + str(student[lst]['Середній бал'] ))
"""  
3 - визначити середній бал по групі
"""
#lst1=(list(student.keys()))
#sum=0
#for lst in student:
    #sum+=student[lst]['Середній бал']
   # students_quantity=len(lst1)
   # average=sum/students_quantity
    #print(average)
"""  
4 - при відсутності номеру телефону у студента записати номер батьків (номер на ваш вибір)
"""

name=input("Введіть ім'я студента:")
last_name=input('Введіть прізвище студента:')
student[name +' '+ last_name]=dict()

email=input('Введіть електронну пошту:')

try:
    age = int(input('Введіть вік:'))
    while age < 18 or age > 40:
        print('Вік студента повинен бути від 18 до 40 років в числовому форматі без пунктуації')
        age = int(input('Введіть вік:'))
except ValueError:
        print('Вік студента повинен бути від 18 до 40 років в числовому форматі без пунктуації')
        age = int(input('Введіть вік:'))


phone_number = input('Введіть мобільний номер (якщо стеднт не має власного номеру мобільного телефону введіть "+" та '
'матимете змогу ввести номер телефону одного з батьків:')
if phone_number=='+':
    phone_number=None
    parents_phone=input('Введіть номер одного з батьків студента:')
    student[str(name)+' '+str(last_name)]['Номер батьків студента']=parents_phone
    parents_name=input("Введіть ім'я та побатькові власника номера:")
    parents_phone=(str(parents_phone)+' '+ str(parents_name))


    try:
        mark = int(input('Введіть середній бал:'))
        while mark > 100:
            print('Середній бал повинен бути менше 100 в числовому форматі без пунктуації')
            mark = int(input('Введіть середній бал:'))
    except ValueError:
        print('Середній бал повинен бути менше 100 в числовому форматі без пунктуації')
        age = int(input('Введіть вік:'))

    student[name +' '+ last_name] = dict(
        [('Пошта', email), ('Вік', age), ('Номер телефону', phone_number), ('Номер телефону батьків', parents_phone), ('Середній бал', mark)])
    print(student)
else:
    try:
        mark = int(input('Введіть середній бал:'))
        while mark > 100:
            print('Середній бал повинен бути менше 100 в числовому форматі без пунктуації')
            mark = int(input('Введіть середній бал:'))
    except ValueError:
        print('Середній бал повинен бути менше 100 в числовому форматі без пунктуації')
        age = int(input('Введіть середній бал:'))

    student[name +' '+ last_name] = dict(
        [('Пошта', email), ('Вік', age), ('Номер телефону', phone_number), ('Середній бал', mark)])
    print(student)



"""
не забувайте виводити інформаційні повідомлення щодо інформації, яку ви виводите
"""